package com.llw.game.tank.config

object Maps {
    val Map1= arrayOf(
        arrayOf('1','空','空','空','空','空','空','空','空','空','空','空','空'),
        arrayOf('空','砖','砖','空','砖','空','空','空','空','草','空','砖','空'),
        arrayOf('空','空','空','空','空','砖','砖','砖','砖','空','空','砖','空'),
        arrayOf('水','空','水','空','空','空','空','空','空','空','水','空','水'),
        arrayOf('空','铁','铁','铁','水','空','水','空','空','草','空','空','空'),
        arrayOf('空','铁','空','空','空','铁','空','铁','水','草','草','砖','空'),
        arrayOf('空','铁','草','草','草','铁','空','铁','空','草','草','铁','草'),
        arrayOf('空','空','空','空','铁','铁','空','空','空','空','空','铁','草'),
        arrayOf('草','砖','空','砖','空','砖','砖','砖','空','空','空','砖','草'),
        arrayOf('空','空','空','空','空','空','空','空','空','空','空','空','空'),
        arrayOf('草','空','草','空','草','空','空','空','空','空','空','空','空'),
        arrayOf('空','空','空','空','空','铁','铁','铁','空','空','空','空','空'),
        arrayOf('空','空','空','a','空','铁','基','铁','空','b','空','空','空'))

    val Map2= arrayOf(
        arrayOf('1','空','2','空','3','空','4','空','5','空','6','空','1'),
        arrayOf('空','砖','砖','空','砖','空','空','空','空','草','空','砖','空'),
        arrayOf('空','空','空','空','空','砖','砖','砖','砖','空','空','砖','空'),
        arrayOf('水','空','水','空','空','空','空','空','空','空','水','空','水'),
        arrayOf('空','铁','铁','铁','水','空','水','空','空','草','空','空','空'),
        arrayOf('空','铁','空','空','空','铁','空','铁','水','草','草','砖','空'),
        arrayOf('空','铁','草','草','草','铁','空','铁','空','草','草','铁','草'),
        arrayOf('空','空','空','空','铁','铁','空','空','空','空','空','铁','草'),
        arrayOf('草','砖','空','砖','空','砖','砖','砖','空','空','空','砖','草'),
        arrayOf('空','空','空','空','空','空','空','空','空','空','空','空','空'),
        arrayOf('草','空','草','空','草','空','空','空','空','空','空','空','空'),
        arrayOf('空','空','空','空','空','铁','铁','铁','空','空','空','空','空'),
        arrayOf('空','空','空','a','空','铁','基','铁','空','b','空','空','空'))
}